app/views/bookings/discuss.html.haml

SELECT "booking_messages".* FROM "booking_messages" WHERE ("booking_messages".booking_id = 7) ORDER BY created_at ASC
---
#booking_messages
  -@booking.booking_messages.by_date.each do |message|
    .message{:class=>message.html_class}
      .message_body