app/controllers/bookings_controller.rb

  def discuss
    @rental_unit =  RentalUnit.find(params[:rental_unit_id])
    @booking = @rental_unit.find_uncompleted_booking_for_user_or_create(current_user)
---
SELECT "rental_units".* FROM "rental_units" WHERE ("rental_units"."id" = 21) LIMIT 1
SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 7) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 39) LIMIT 1