app/controllers/messages_controller.rb

  def post_chat
    current_user = User.find_by_fb_user_id(params[:booking_message][:fb_user_id])
    current_user.pulse!
    @booking = Booking.find(params[:booking_message][:booking_id])
    message= BookingMessage.create!(:user_fb_id=>current_user.fb_user_id,:booking_id=>@booking.id,:message=>params[:booking_message][:message])
---
SELECT "users".* FROM "users" WHERE ("users"."fb_user_id" = '13579') LIMIT 1
SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 7) LIMIT 1
INSERT INTO "booking_messages" ("booking_id", "created_at", "message", "updated_at", "user_fb_id") VALUES (7, '2010-11-08 22:13:14.693363', 'I want to stay here', '2010-11-08 22:13:14.693363', '13579')